
&НаКлиенте
Процедура ЗагрузитьДанные(Команда)
	Если Не ЗначениеЗаполнено(Покупатель) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Заполните покупателя");
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Договор) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Заполните договор");
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(НомерЗаказаКлиента) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Заполните номер заказа клиента");
		Возврат;
	КонецЕсли;
	РезультатЗагрузки = ЗагрузитьДанныеНаСервере();
	Если ЗначениеЗаполнено(РезультатЗагрузки) Тогда
		ПоказатьОповещениеПользователя("Данные загружены", , "Заказ покупателя успешно создан!");
		Оповестить("ОбновитьСписокАРМ", РезультатЗагрузки, ЭтаФорма); 
		Закрыть(); 	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЗагрузитьДанныеНаСервере()
	
	НачатьТранзакцию();
	Попытка
		НовыйЗаказПокупателя = Документы.ЗаказПокупателя.СоздатьДокумент();
		НовыйЗаказПокупателя.Дата = ТекущаяДатаСеанса(); 
		НовыйЗаказПокупателя.Контрагент = Покупатель;
		НовыйЗаказПокупателя.Договор = Договор;
		НовыйЗаказПокупателя.НомерЗаказаКлиента = НомерЗаказаКлиента;
		АРМ_ЗагрузитьДанныеНаСервере(НовыйЗаказПокупателя);
		Если НовыйЗаказПокупателя.Запасы.Количество() > 0 Тогда  
			НовыйЗаказПокупателя.Записать(РежимЗаписиДокумента.Запись);
			ЗафиксироватьТранзакцию();
			Возврат НовыйЗаказПокупателя.Ссылка;
		Иначе
		    Возврат Неопределено;
		КонецЕсли;
	Исключение
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		ТекстОшибки = СтрШаблон(
			"Ошибка при создании заказа: %1",
				КраткоеПредставлениеОшибки(ИнформацияОбОшибке())
		);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

&НаСервере
Процедура АРМ_ЗагрузитьДанныеНаСервере(НовыйЗаказПокупателя)
	
	ПустыхСтрокПодряд = 0;
	ВысотаДокумента = ЭтотОбъект.АРМ_ДанныеЗагрузки.ВысотаТаблицы;
	
	Для НомерСтроки = 2 По ВысотаДокумента Цикл
		
		Артикул = СокрЛП(ЭтотОбъект.АРМ_ДанныеЗагрузки.Область(НомерСтроки, 6).Текст);
		Наименование = СокрЛП(ЭтотОбъект.АРМ_ДанныеЗагрузки.Область(НомерСтроки, 7).Текст);
		
		Если ПустаяСтрока(Артикул) И ПустаяСтрока(Наименование) Тогда
			ПустыхСтрокПодряд = ПустыхСтрокПодряд + 1;
			Если ПустыхСтрокПодряд > 10 Тогда
				Прервать;
			Иначе
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		ПустыхСтрокПодряд = 0;
		
		НоваяСтрока = НовыйЗаказПокупателя.Запасы.Добавить();
		
		НоваяСтрока.НомерКлиента = НомерЗаказаКлиента;
		НоваяСтрока.СрочностьКлиента = СокрЛП(ЭтотОбъект.АРМ_ДанныеЗагрузки.Область(НомерСтроки, 3).Текст);
		НоваяСтрока.ГРЗКлиента = СокрЛП(ЭтотОбъект.АРМ_ДанныеЗагрузки.Область(НомерСтроки, 4).Текст);
		НоваяСтрока.ТерриторияКлиента = СокрЛП(ЭтотОбъект.АРМ_ДанныеЗагрузки.Область(НомерСтроки, 5).Текст);
		НоваяСтрока.ЕдиницаИзмеренияКлиента = СокрЛП(ЭтотОбъект.АРМ_ДанныеЗагрузки.Область(НомерСтроки, 8).Текст);
		
		НоваяСтрока.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
		
		ТекстТерритория = СокрЛП(ЭтотОбъект.АРМ_ДанныеЗагрузки.Область(НомерСтроки, 5).Текст);
		Если НЕ ПустаяСтрока(ТекстТерритория) Тогда
			НоваяСтрока.ТерриторияКлиента = ТекстТерритория;
		КонецЕсли;
		
		НоваяСтрока.АртикулКлиента = Артикул;
		НоваяСтрока.НоменклатураКлиента = Наименование;
		
		ТекстКоличество = СокрЛП(ЭтотОбъект.АРМ_ДанныеЗагрузки.Область(НомерСтроки, 9).Текст);
		
		Если НЕ ПустаяСтрока(ТекстКоличество) Тогда
			НоваяСтрока.КоличествоКлиента = ТекстКоличество;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	АРМ_ИнициализироватьТабличныйДокументЗагрузки();
КонецПроцедуры

&НаСервере
Процедура АРМ_ИнициализироватьТабличныйДокументЗагрузки()
	
	АРМ_ДанныеЗагрузки = Новый ТабличныйДокумент;
	АРМ_ДанныеЗагрузки.ТолькоПросмотр = ЛОЖЬ;
	АРМ_ДанныеЗагрузки.Защита = Ложь;
	
	АРМ_ДанныеЗагрузки.Область(1, 1).Текст = "Номер";
	АРМ_ДанныеЗагрузки.Область(1, 2).Текст = "Дата заказа";
	АРМ_ДанныеЗагрузки.Область(1, 3).Текст = "Срочность";
	АРМ_ДанныеЗагрузки.Область(1, 4).Текст = "ГРЗ";
	АРМ_ДанныеЗагрузки.Область(1, 5).Текст = "Территория";
	АРМ_ДанныеЗагрузки.Область(1, 6).Текст = "Артикул";
	АРМ_ДанныеЗагрузки.Область(1, 7).Текст = "Наименование";
	АРМ_ДанныеЗагрузки.Область(1, 8).Текст = "Единица измерения";
	АРМ_ДанныеЗагрузки.Область(1, 9).Текст = "Количество";
	
	ЛинияРамки = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
	
	Для НомерКолонки = 1 По 9 Цикл
		
		ОбластьЯчейки = АРМ_ДанныеЗагрузки.Область(1, НомерКолонки);
		ОбластьЯчейки.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
		ОбластьЯчейки.ЦветФона = WebЦвета.СеребристоСерый;
		ОбластьЯчейки.Защита = Истина;
		ОбластьЯчейки.Обвести(ЛинияРамки, ЛинияРамки, ЛинияРамки, ЛинияРамки);
		
	КонецЦикла;
	
	АРМ_ДанныеЗагрузки.ФиксацияСверху = 1;
	
	АРМ_ДанныеЗагрузки.Область(1, 1).ШиринаКолонки = 12;  // Номер
	АРМ_ДанныеЗагрузки.Область(1, 2).ШиринаКолонки = 12;  // Дата заказа
	АРМ_ДанныеЗагрузки.Область(1, 3).ШиринаКолонки = 12;  // Срочность
	АРМ_ДанныеЗагрузки.Область(1, 4).ШиринаКолонки = 12;  // ГРЗ
	АРМ_ДанныеЗагрузки.Область(1, 5).ШиринаКолонки = 15;  // Территория
	АРМ_ДанныеЗагрузки.Область(1, 6).ШиринаКолонки = 15;  // Артикул
	АРМ_ДанныеЗагрузки.Область(1, 7).ШиринаКолонки = 60;  // Наименование
	АРМ_ДанныеЗагрузки.Область(1, 8).ШиринаКолонки = 15;  // Единица измерения
	АРМ_ДанныеЗагрузки.Область(1, 9).ШиринаКолонки = 12;  // Количество
	
КонецПроцедуры

&НаСервере
Процедура ПокупательПриИзмененииНаСервере()
	
	Если Не ЗначениеЗаполнено(Договор) Тогда
		Договор = Арм_ОбщегоНазначенияАРМ.НайтиДоговор(Покупатель);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПокупательПриИзменении(Элемент)
	ПокупательПриИзмененииНаСервере();
КонецПроцедуры
