&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	УстановитьПериодНаСервере();
КонецПроцедуры

&НаСервере
Процедура УстановитьПериодНаСервере()
	
	ПараметрыСписка = ДанныеАРМОтображениеСнабжение.КомпоновщикНастроек.Настройки.ПараметрыДанных;
	
	ПараметрНачало = ПараметрыСписка.Элементы.Найти("ДатаНачала");
	Если ПараметрНачало <> Неопределено Тогда
		ПараметрНачало.Значение      = Период.ДатаНачала;
		ПараметрНачало.Использование = ЗначениеЗаполнено(Период.ДатаНачала);
	КонецЕсли;
	
	ПараметрКонец = ПараметрыСписка.Элементы.Найти("ДатаОкончания");
	Если ПараметрКонец <> Неопределено Тогда
		ПараметрКонец.Значение      = КонецДня(Период.ДатаОкончания);
		ПараметрКонец.Использование = ЗначениеЗаполнено(Период.ДатаОкончания);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Попытка
		МассивСтатусыСтрок = Новый Массив;
		МассивСтатусыСтрок.Добавить(Перечисления.Арм_СтатусыАРМ.Заказано);
		МассивСтатусыСтрок.Добавить(Перечисления.Арм_СтатусыАРМ.Оплачено);
		МассивСтатусыСтрок.Добавить(Перечисления.Арм_СтатусыАРМ.ТоварВПути);
		МассивСтатусыСтрок.Добавить(Перечисления.Арм_СтатусыАРМ.Приходуется);
		МассивСтатусыСтрок.Добавить(Перечисления.Арм_СтатусыАРМ.НаСкладе);
		МассивСтатусыСтрок.Добавить(Перечисления.Арм_СтатусыАРМ.Комплектуется);
		МассивСтатусыСтрок.Добавить(Перечисления.Арм_СтатусыАРМ.Собран);
		МассивСтатусыСтрок.Добавить(Перечисления.Арм_СтатусыАРМ.Отгружено);
		ДанныеАРМОтображениеСнабжение.Параметры.УстановитьЗначениеПараметра("СтатусыСтрок", МассивСтатусыСтрок);
		Период.Вариант = ВариантСтандартногоПериода.ЭтотМесяц;
	Исключение
		ЗаписатьОшибкуУсловногоОформления();
	Конецпопытки;
	
	Попытка
		УстановитьПериодНаСервере();
	Исключение
		ЗаписатьОшибкуУсловногоОформления();
	Конецпопытки;
	
	Попытка
		ОбновитьФлагГруппировкиПоЗаказуПокупателя();
	Исключение
		ЗаписатьОшибкуУсловногоОформления();
	Конецпопытки;
	
	Попытка
		ОбновитьФлагГруппировкиСтатус();
	Исключение
		ЗаписатьОшибкуУсловногоОформления();
	Конецпопытки;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьФлагГруппировкиПоЗаказуПокупателя()
	
	СохраненныйФлаг = ХранилищеОбщихНастроек.Загрузить("АРМ_НастройкаГруппировки", "ФлагГруппировки");
    СгруппироватьПоЗаказуПокупателя = ?(СохраненныйФлаг = Неопределено, Ложь, СохраненныйФлаг);
	УстановитьГруппировкуНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьФлагГруппировкиСтатус()
	
	СохраненныйФлаг = ХранилищеОбщихНастроек.Загрузить("АРМ_НастройкаГруппировкиСтатус", "ФлагГруппировкиСтатус");
    СгруппироватьПоЗаказуПокупателя = ?(СохраненныйФлаг = Неопределено, Ложь, СохраненныйФлаг);
	УстановитьГруппировкуСнабженияНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьОшибкуУсловногоОформления()
	
	ТекстОшибкиИнтерфейса = СтрШаблон(
		"Сбой при сборке условного оформления АРМа: %1", 
		КраткоеПредставлениеОшибки(ИнформацияОбОшибке())
	);
	
	ЗаписьЖурналаРегистрации(
		"АРМ.ОшибкаИнтерфейса", 
		УровеньЖурналаРегистрации.Предупреждение, 
		, 
		, 
		ТекстОшибкиИнтерфейса
	);
		
КонецПроцедуры

&НаКлиенте
Процедура ДанныеАРМОтображениеСнабжениеПриАктивизацииЯчейки(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат; 
	КонецЕсли;
	
	Если ТекущиеДанные.Свойство("СтрокаЗаблокирована") И ТекущиеДанные.СтрокаЗаблокирована Тогда 
		Возврат; 
	КонецЕсли;	
	
	Если Не ТекущиеДанные.Свойство("ИдентификаторЗаписи") Или Не ТекущиеДанные.Свойство("ОтметкаСтроки") Тогда
		Возврат;
	КонецЕсли;
	Если Элемент.ТекущийЭлемент.Имя = "ДанныеАРМОтображениеСнабжениеОтметкаСтроки" Тогда 
		ИнвертироватьФлагНаСервере(ТекущиеДанные.ИдентификаторЗаписи, ТекущиеДанные.ОтметкаСтроки);
		ОбновитьСписокПоТаймеру();
		Элементы.ДанныеАРМОтображениеСнабжение.ТекущийЭлемент = Элементы.ДанныеАРМОтображениеСнабжениеНоменклатураКлиента;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокПоТаймеру()
	Элементы.ДанныеАРМОтображениеСнабжение.Обновить();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИнвертироватьФлагНаСервере(Знач ИдентификаторЗаписи, Знач ЗначениеФлага)
	
	Набор = РегистрыСведений.Арм_ДанныеЗакупокИПродаж.СоздатьНаборЗаписей();
	Набор.Отбор.ИдентификаторЗаписи.Установить(ИдентификаторЗаписи);
	Набор.Прочитать();
	
	Если Набор.Количество() > 0 Тогда
		
		Запись = Набор[0]; 
		
		Если ЗначениеЗаполнено(Запись.АвторСтроки) И Запись.АвторСтроки <> ПараметрыСеанса.ТекущийПользователь Тогда
			Возврат; 
		КонецЕсли;
		
		Запись.ОтметкаСтроки = Не ЗначениеФлага;
		
		Если (Не ЗначениеФлага) = Ложь Тогда
			Запись.АвторСтроки = Справочники.Пользователи.ПустаяСсылка();
		Иначе
			Запись.АвторСтроки = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
		
		Попытка
			Набор.Записать();
		Исключение
			ТекстОшибки = СтрШаблон(
				"Ошибка записи флажка для ID %1: %2", 
				ИдентификаторЗаписи, 
				КраткоеПредставлениеОшибки(ИнформацияОбОшибке())
			);
			ЗаписьЖурналаРегистрации("АРМ.ОшибкаГалки", УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьВсеСтрокиЗаказа(Команда)
	ДанныеСтроки = Элементы.ДанныеАРМОтображениеСнабжение.ТекущиеДанные;
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ОбработатьНажатиеФлагиВыделения(ДанныеСтроки);
КонецПроцедуры 

&НаКлиенте
Процедура ОбработатьНажатиеФлагиВыделения(ДанныеСтроки)

	Если Не ДанныеСтроки.Свойство("ДокументЗаказПокупателя") И Не ЗначениеЗаполнено(ДанныеСтроки.ДокументЗаказПокупателя)
		Или ДанныеСтроки.Свойство("ГруппировкаСтроки") Тогда
		ТекстСообщения = "Для того, чтобы отметить все галки встаньте на строку, а не на группировку";
		ПоказатьОповещениеПользователя("Внимание!", , ТекстСообщения);
		Возврат;
	КонецЕсли;
	НовоеЗначениеФлага = Не ДанныеСтроки.ОтметкаСтроки;
	ВыделитьВсеСтрокиЗаказаНаСервере(ДанныеСтроки.ДокументЗаказПокупателя, ДанныеСтроки.ВидОперации, НовоеЗначениеФлага);
	ОбновитьСписокПоТаймеру();
	
КонецПроцедуры

&НаСервере
Процедура ВыделитьВсеСтрокиЗаказаНаСервере(ДокЗаказПокупателя, ВидОперации, НовоеЗначениеФлага)
	
	АвторДляЗаписи = ?(НовоеЗначениеФлага, ПараметрыСеанса.ТекущийПользователь, Справочники.Пользователи.ПустаяСсылка());
	
	Набор = РегистрыСведений.Арм_ДанныеЗакупокИПродаж.СоздатьНаборЗаписей();
	Набор.Отбор.ДокументЗаказПокупателя.Установить(ДокЗаказПокупателя);
	Набор.Прочитать();
	
	Для Каждого Запись Из Набор Цикл
		Если Запись.ВидОперации = ВидОперации Тогда
			Запись.ОтметкаСтроки = НовоеЗначениеФлага;
			Запись.АвторСтроки   = АвторДляЗаписи;
		КонецЕсли;
	КонецЦикла;
	
	Попытка
		Набор.Записать();
	Исключение
		ТекстОшибки = СтрШаблон(
			"Ошибка записи в АРМ-регистр. Выделение всех строк пользователем %1, подробно: %2", 
			ПараметрыСеанса.ТекущийПользователь, 
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке())
		);
		ЗаписьЖурналаРегистрации(
			"АРМ.ВыделениеВсехСтрок", 
			УровеньЖурналаРегистрации.Ошибка, 
			, 
			, 
			ТекстОшибки
		);
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура СгруппироватьПоЗаказуПокупателяПриИзменении(Элемент)
	УстановитьГруппировкуНаСервере();
КонецПроцедуры

&НаСервере
Процедура УстановитьГруппировкуНаСервере()
    
    Настройки = ДанныеАРМОтображениеСнабжение.КомпоновщикНастроек.Настройки;
    Настройки.Структура.Очистить();
    
	Если СгруппироватьПоЗаказуПокупателя Тогда
		ГруппироватьСтрокиПоСтатусам = Ложь;
        ГруппировкаПоЗаказу = Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
        
        ПолеГрупп = ГруппировкаПоЗаказу.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
        ПолеГрупп.Поле = Новый ПолеКомпоновкиДанных("ДокументЗаказПокупателя");
        ПолеГрупп.Использование = Истина;
        
        Детальные = ГруппировкаПоЗаказу.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
    Иначе
        Детальные = Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
    КонецЕсли;
    
    Детальные.Использование = Истина;
    Детальные.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
    
    ДанныеАРМОтображениеСнабжение.КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	ХранилищеОбщихНастроек.Сохранить("АРМ_НастройкаГруппировки", "ФлагГруппировки", СгруппироватьПоЗаказуПокупателя);

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПериод(Команда)
	Период = Неопределено;
	УстановитьПериодНаСервере();
КонецПроцедуры 

&НаКлиенте
Процедура ИзменитьСтатусОтмеченныхСтрок(ЦелевойСтатус)
	
	ВидОперации = ПредопределенноеЗначение("Перечисление.Арм_ВидыОпераций.Закупка");
	МассивИдентификаторов = Арм_ОбщегоНазначенияАРМ.ПолучитьМассивОтмеченныхИдентификаторов(ВидОперации);
	Если МассивИдентификаторов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураИтога = Арм_ОбщегоНазначенияАРМ.ИзменитьСтатусыВРегистреСнабжения(МассивИдентификаторов, ЦелевойСтатус);
	
	Если СтруктураИтога.Успешно Тогда
		Элементы.ДанныеАРМОтображениеСнабжение.Обновить(); 
		
		Если СтруктураИтога.КоличествоОбработанных = 0 Тогда
			ПоказатьОповещениеПользователя("Статус не изменен", ,"Ни одна из отмеченных строк не может перейти в этот статус согласно цепочке!");
		Иначе
			ТекстОповещения = СтрШаблон(
				"Успешно переведено позиций: %1 из %2 шт.", 
				СтруктураИтога.КоличествоОбработанных, 
				МассивИдентификаторов.Количество()
			);
			ПоказатьОповещениеПользователя("Успешно", , ТекстОповещения);
		КонецЕсли;
	Иначе
		ПоказатьПредупреждение(, СтруктураИтога.ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Оплачено(Команда)
	ИзменитьСтатусОтмеченныхСтрок(ПредопределенноеЗначение("Перечисление.Арм_СтатусыАРМ.Оплачено"));
КонецПроцедуры

&НаКлиенте
Процедура ТоварВПути(Команда)
	ИзменитьСтатусОтмеченныхСтрок(ПредопределенноеЗначение("Перечисление.Арм_СтатусыАРМ.ТоварВПути"));
КонецПроцедуры

&НаКлиенте
Процедура Приходуется(Команда)
	ИзменитьСтатусОтмеченныхСтрок(ПредопределенноеЗначение("Перечисление.Арм_СтатусыАРМ.Приходуется"));
КонецПроцедуры

&НаКлиенте
Процедура НаСкладе(Команда)
	ИзменитьСтатусОтмеченныхСтрок(ПредопределенноеЗначение("Перечисление.Арм_СтатусыАРМ.НаСкладе"));
КонецПроцедуры

&НаКлиенте
Процедура Комплектуется(Команда)
	ИзменитьСтатусОтмеченныхСтрок(ПредопределенноеЗначение("Перечисление.Арм_СтатусыАРМ.Комплектуется"));
КонецПроцедуры

&НаКлиенте
Процедура Собран(Команда)
	
	ВидОперации = ПредопределенноеЗначение("Перечисление.Арм_ВидыОпераций.Закупка");
	МассивИдентификаторов = Арм_ОбщегоНазначенияАРМ.ПолучитьМассивОтмеченныхИдентификаторов(ВидОперации);
	Если МассивИдентификаторов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ПроверитьЧастичныйПриходНаСервере(МассивИдентификаторов) Тогда
		
		ПараметрыВызова = Новый Структура("МассивИД", МассивИдентификаторов);
		Оповещение = Новый ОписаниеОповещения("ПослеВопросаОЧастичномПриходе", ЭтотОбъект, ПараметрыВызова);
		
		ПоказатьВопрос(Оповещение, 
			"Внимание! Вы приходуете только часть Заказа Поставщику. Остальные строки еще не готовы. Создать частичную Приходную Накладную?", 
			РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, "Контроль снабжения");
	Иначе
		СтруктураИтога = Арм_ОбщегоНазначенияАРМ.ИзменитьСтатусыВРегистреСнабжения(
			МассивИдентификаторов, 
			ПредопределенноеЗначение("Перечисление.Арм_СтатусыАРМ.Собран")
		);
		Если СтруктураИтога.Успешно Тогда
			Элементы.ДанныеАРМОтображениеСнабжение.Обновить(); 
			Если СтруктураИтога.КоличествоОбработанных = 0 Тогда
				ПоказатьОповещениеПользователя("Статус не изменен", ,"Ни одна из отмеченных строк не может перейти в этот статус согласно цепочке!");
			Иначе
				ТекстОповещения = СтрШаблон(
					"Успешно переведено позиций: %1 из %2 шт.", 
					СтруктураИтога.КоличествоОбработанных, 
					МассивИдентификаторов.Количество()
				);
				ПоказатьОповещениеПользователя("Успешно", , ТекстОповещения);
			КонецЕсли;
		Иначе
			ПоказатьПредупреждение(, СтруктураИтога.ТекстОшибки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОЧастичномПриходе(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ИзменитьСтатусОтмеченныхСтрок(ПредопределенноеЗначение("Перечисление.Арм_СтатусыАРМ.Собран"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьЧастичныйПриходНаСервере(МассивИдентификаторов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Внутр.ДокументЗаказПоставщика КАК ЗаказПоставщика
		|ПОМЕСТИТЬ втВыбранныеЗаказы
		|ИЗ
		|	РегистрСведений.Арм_ДанныеЗакупокИПродаж КАК Внутр
		|ГДЕ
		|	Внутр.ИдентификаторЗаписи В(&МассивИдентификаторов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	1 КАК Поле
		|ИЗ
		|	РегистрСведений.Арм_ДанныеЗакупокИПродаж КАК Т
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втВыбранныеЗаказы КАК ВТ_Заказы
		|		ПО Т.ДокументЗаказПоставщика = ВТ_Заказы.ЗаказПоставщика
		|ГДЕ
		|	НЕ Т.ИдентификаторЗаписи В (&МассивИдентификаторов)
		|	И НЕ Т.Удаление
		|	И Т.СтатусСтроки В (&МассивСтатусов)
		|	И Т.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Арм_ВидыОпераций.Закупка)";
	
	Запрос.УстановитьПараметр("МассивИдентификаторов", МассивИдентификаторов);
	МассивСтатусов = Новый Массив;
	МассивСтатусов.Добавить(Перечисления.Арм_СтатусыАРМ.Оплачено);
	МассивСтатусов.Добавить(Перечисления.Арм_СтатусыАРМ.ТоварВПути);
	МассивСтатусов.Добавить(Перечисления.Арм_СтатусыАРМ.Приходуется);
	МассивСтатусов.Добавить(Перечисления.Арм_СтатусыАРМ.НаСкладе);
	МассивСтатусов.Добавить(Перечисления.Арм_СтатусыАРМ.Комплектуется);
	//МассивСтатусов.Добавить(Перечисления.Арм_СтатусыАРМ.Собран);
	Запрос.УстановитьПараметр("МассивСтатусов", МассивСтатусов);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

&НаСервере
Процедура УстановитьГруппировкуСнабженияНаСервере()
	
	Настройки = ДанныеАРМОтображениеСнабжение.КомпоновщикНастроек.Настройки;
    Настройки.Структура.Очистить();
    
	Если ГруппироватьСтрокиПоСтатусам Тогда
		
		СгруппироватьПоЗаказуПокупателя = Ложь;
        ГруппировкаПоЗаказу = Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
        
        ПолеГрупп = ГруппировкаПоЗаказу.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
        ПолеГрупп.Поле = Новый ПолеКомпоновкиДанных("СтатусСтроки");
        ПолеГрупп.Использование = Истина;
        
        Детальные = ГруппировкаПоЗаказу.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
    Иначе
        Детальные = Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
    КонецЕсли;
    
    Детальные.Использование = Истина;
    Детальные.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
    
    ДанныеАРМОтображениеСнабжение.КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	ХранилищеОбщихНастроек.Сохранить("АРМ_НастройкаГруппировкиСтатус", "ФлагГруппировкиСтатус", ГруппироватьСтрокиПоСтатусам);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппироватьСтрокиПоСтатусамПриИзменении(Элемент)
	УстановитьГруппировкуСнабженияНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДанныеАРМОтображениеСнабжениеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	 ДанныеСтроки = Элемент.ТекущиеДанные;
	Если ДанныеСтроки = Неопределено Тогда 
		Возврат; 
	КонецЕсли;
	
	Если Поле.Имя = "ДанныеАРМОтображениеСнабжениеДатаОтгрузки" Тогда
		
		Возврат;
		
		Если Не ДанныеСтроки.Свойство("ДатаПоступления") Тогда
			Возврат;
		КонецЕсли;
		ДатаДляВвода = ?(ЗначениеЗаполнено(ДанныеСтроки.ДатаПоступления), ДанныеСтроки.ДатаПоступления, ТекущаяДата());
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВводаДатыПоступления", ЭтотОбъект, ДанныеСтроки);
		ПоказатьВводДаты(ОписаниеОповещения, ДатаДляВвода, "Укажите дату поступления:", ЧастиДаты.Дата);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаДатыПоступления(Результат, ДанныеСтроки) Экспорт
	Если Результат <> Неопределено Тогда
        ДанныеСтроки.ДатаПоступления = Результат; 
        ИзменитьДатуПоступленияНаСервере(ДанныеСтроки); 
        ОбновитьСписокПоТаймеру();
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ИзменитьДатуПоступленияНаСервере(ДанныеСтроки)
    
	Набор = РегистрыСведений.Арм_ДанныеЗакупокИПродаж.СоздатьНаборЗаписей();
    Набор.Отбор.ИдентификаторЗаписи.Установить(ДанныеСтроки.ИдентификаторЗаписи);
    Набор.Прочитать();
    
    Если Набор.Количество() > 0 Тогда
        
        Запись = Набор[0];
        Запись.ДатаПоступления = ДанныеСтроки.ДатаПоступления;
        
        Попытка
            Набор.Записать();
        Исключение
            ЗаписьЖурналаРегистрации("АРМ.ОшибкаЗаписиДатаОтгрузки", 
                УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
        КонецПопытки;
        
    КонецЕсли;
    
КонецПроцедуры
