
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	ТекущаяРоль = РегистрыСведений.Арм_ПраваПользователей.ПолучитьРольИнтерфейсаПользователя(ПараметрыСеанса.ТекущийПользователь);
	
	Если ТекущаяРоль = Перечисления.Арм_РолиИнтерфейса.Снабжение Тогда
		СтандартнаяОбработка = Ложь;
		ВыбраннаяФорма = "Обработка.АС_АРМ2.Форма.ФормаСнабжение";
	КонецЕсли; 
	
	Если ТекущаяРоль = Перечисления.Арм_РолиИнтерфейса.Менеджер Тогда
		СтандартнаяОбработка = Ложь;
		ВыбраннаяФорма = "Обработка.АС_АРМ2.Форма.Форма";
	КонецЕсли;
	
КонецПроцедуры
