
&После("ПриЗаписи")
Процедура Арм_ПриЗаписи(Отказ)
	
	//Если Не Отказ Тогда
	//	ИдентификацияВАРМ();
	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИдентификацияВАРМ()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Арм_ДанныеЗакупокИПродаж.ИдентификаторЗаписи КАК ИдентификаторЗаписи
		|ИЗ
		|	РегистрСведений.Арм_ДанныеЗакупокИПродаж КАК Арм_ДанныеЗакупокИПродаж
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК ЗаказПоставщику
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
		|			ПО ЗаказПоставщику.Ссылка = ПриходнаяНакладная.ДокументОснование
		|		ПО Арм_ДанныеЗакупокИПродаж.ДокументЗаказПоставщика = ЗаказПоставщику.Ссылка
		|ГДЕ
		|	ПриходнаяНакладная.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаАРМ = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаАРМ.Следующий() Цикл
		
		Набор = РегистрыСведений.Арм_ДанныеЗакупокИПродаж.СоздатьНаборЗаписей();
		Набор.Отбор.ИдентификаторЗаписи.Установить(ВыборкаАРМ.ИдентификаторЗаписи);
		Набор.Прочитать();
		
		Если Набор.Количество() > 0 Тогда
			
			Запись = Набор[0]; 
			Запись.СтатусСтроки = Перечисления.Арм_СтатусыАРМ.НаСкладе;
			
			Попытка
				Набор.Записать();
			Исключение
				ЗаписьЖурналаРегистрации(
					"АРМ.Проведение ПриходнаяНакладная", 
					УровеньЖурналаРегистрации.Ошибка, 
					, 
					, 
					ОписаниеОшибки()
				);
				ВызватьИсключение;
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры

&После("ОбработкаПроведения")
Процедура Арм_ОбработкаПроведения(Отказ, РежимПроведения)
	//Если Не Отказ Тогда
	//	ИдентификацияВАРМ();
	//КонецЕсли;
КонецПроцедуры
