
&После("ПриЗаписи")
Процедура Арм_ПриЗаписи(Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("Арм_ПрограммнаяЗапись") Тогда
		Возврат;
	КонецЕсли;
	
	Если Ссылка.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтотОбъект.ДополнительныеСвойства.Свойство("Арм_ЭтоПерваяЗапись") Тогда
		Возврат;
	КонецЕсли;
	
	ЗапросЗащита = Новый Запрос;
	ЗапросЗащита.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	1 КАК Поле
		|ИЗ
		|	РегистрСведений.Арм_ДанныеЗакупокИПродаж КАК Рег
		|ГДЕ
		|	Рег.ДокументЗаказПокупателя = &Ссылка
		|	И НЕ Рег.Удаление";
	ЗапросЗащита.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	Результат = ЗапросЗащита.Выполнить();
	Если Не Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.Арм_ДанныеЗакупокИПродаж.ОбновитьДанныеПоОбъекту(Ссылка, Запасы.Выгрузить(), Истина);
    
КонецПроцедуры

&Перед("ПередЗаписью")
Процедура Арм_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Ссылка.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("Арм_ПрограммнаяЗапись") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтотОбъект.ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект.ДополнительныеСвойства.Вставить("Арм_ЭтоПерваяЗапись", Истина);
	
	Для Каждого СтрокаТЧ Из Запасы Цикл
		Если ПустаяСтрока(СтрокаТЧ.КлючСвязиСтрок) Тогда
			СтрокаТЧ.КлючСвязиСтрок = Строка(Новый УникальныйИдентификатор);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&После("ПриКопировании")
Процедура Арм_ПриКопировании(ОбъектКопирования)
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("Арм_ПрограммнаяЗапись") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТЧ Из Запасы Цикл
		СтрокаТЧ.КлючСвязиСтрок = Строка(Новый УникальныйИдентификатор);
	КонецЦикла;
	
КонецПроцедуры
