Функция ПолучитьРольИнтерфейсаПользователя(Знач ТекущийПользователь) Экспорт
	
	ЗначениеПоУмолчанию = Перечисления.Арм_РолиИнтерфейса.Менеджер;
	
	Если Не ЗначениеЗаполнено(ТекущийПользователь) Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	ЗапросПрава = Новый Запрос;
	ЗапросПрава.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Рег.РольИнтерфейса КАК РольИнтерфейса
		|ИЗ
		|	РегистрСведений.Арм_ПраваПользователей КАК Рег
		|ГДЕ
		|	Рег.Пользователь = &Пользователь";
		
	ЗапросПрава.УстановитьПараметр("Пользователь", ТекущийПользователь);
	Выборка = ЗапросПрава.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.РольИнтерфейса;
	КонецЕсли;
	
	Возврат ЗначениеПоУмолчанию;
	
КонецФункции