
&НаСервере
Процедура АС_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	НоваяГруппа = Элементы.Добавить("АС_Дополнительно", Тип("ГруппаФормы"), Элементы.СвернутыеГруппы);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.Заголовок = НСтр("ru = 'Автосервис'");
	НоваяГруппа.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.Картинка;
	НоваяГруппа.Поведение = ПоведениеОбычнойГруппы.Свертываемая;
	НоваяГруппа.ЗаголовокСвернутогоОтображения = НСтр("ru = 'Автосервис'");
	
	НоваяГруппаВертикальная = Элементы.Добавить("АС_ДополнительнаяИнформация", Тип("ГруппаФормы"), НоваяГруппа);
	НоваяГруппаВертикальная.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппаВертикальная.ОтображатьЗаголовок = Ложь;
	НоваяГруппаВертикальная.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	НовыйЭлемент = Элементы.Добавить("АС_СтранаПроисхожденияДляПечати", Тип("ПолеФормы"), НоваяГруппаВертикальная);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.АС_СтранаПроисхожденияДляПечати";
	
	НовыйЭлемент = Элементы.Добавить("АС_Принадлежность", Тип("ПолеФормы"), НоваяГруппаВертикальная);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.АС_Принадлежность";
	
	НовыйЭлемент = Элементы.Добавить("АС_КодАвтоАльянс", Тип("ПолеФормы"), НоваяГруппаВертикальная);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.АС_КодАвтоАльянс";
	
КонецПроцедуры
